htmlToPdf/app/Controllers/FactureController.php

    public function index()
    {
        $model = new FactureModel();
        $data['factures'] = $model->findAll();
---
SELECT *
FROM `factures`

    public function voir($id)
    {
        $model = new FactureModel();
        $data['facture'] = $model->find($id);
---
SELECT *
FROM `factures`
WHERE `factures`.`id` = '1'

    public function pdf($id)
    {
        $model = new FactureModel();
        $data['facture'] = $model->find($id);
---
SELECT *
FROM `factures`
WHERE `factures`.`id` = '1'